---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayComponents
source: html/e7548a82-0345-812b-caf2-a60df9e2870e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceDisplayComponents Property

"Components"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceDisplayComponents { get; }
```